src/main/resources/uml/02-상속을-통한-확장.mermaid
classDiagram
    class PaymentService {
        <<abstract>>
        + add()
        # getExchangeRate()*
    }
    class HttpApiPaymentService {
        # getExchangeRate()
    }
    class SimplePaymentService {
        # getExchangeRate()
    }

    PaymentService <|-- HttpApiPaymentService
    PaymentService <|-- SimplePaymentService
